tap 'bramstein/webfonttools'
tap 'elastic/tap'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

brew 'ack' # a tool like grep, optimized for programmers
brew 'aircrack-ng' # a complete suite of tools to assess WiFi network security.
brew 'autoconf' # an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages.
brew 'automake' # a tool for automatically generating Makefile in files compliant with the GNU Coding Standards
brew 'awscli' # a unified tool to manage your AWS services.
brew 'bash' # an sh-compatible shell that incorporates useful features from the Korn shell (ksh) and C shell (csh)
brew 'bash-completion@2' # Programmable completion functions for bash
brew 'bfg' # Removes large or troublesome blobs like git-filter-branch does, but faster. And written in Scala
brew 'binutils' # The GNU Binutils are a collection of binary tools
brew 'bramstein/webfonttools/sfnt2woff' # Tool for converting TrueType and OpenType font files to WOFF made by Jonathan Kew.
brew 'bramstein/webfonttools/sfnt2woff-zopfli' # Modified version of sfnt2woff that uses the Zopfli compression algorithm (2-5% better compression than standard WOFF).
brew 'bramstein/webfonttools/woff2' # WOFF2 compression and decompression utilities by Google.
brew 'cifer' # Work on automating classical cipher cracking in C.
brew 'coreutils' # The GNU Core Utilities are the basic file, shell and text manipulation utilities of the GNU operating system.
brew 'curl'
brew 'dark-mode' # Toggle the macOS Dark Mode from the command-line
brew 'dns2tcp' # Dns2tcp is a network tool designed to relay TCP connections through DNS traffic.
brew 'elastic/tap/kibana-full' # Kibana is an open source analytics and visualization platform designed to work with Elasticsearch.
brew 'elasticsearch' # a distributed, RESTful search and analytics engine
brew 'fcrackzip' # FCrackZip is a free and fast zip password cracker
brew 'ffmpeg' # a complete, cross-platform solution to record, convert and stream audio and video. It includes libavcodec - the leading audio/video codec library.
brew 'findutils' # The GNU Find Utilities are the basic directory searching utilities of the GNU operating system.
brew 'foremost' # a console program to recover files based on their headers, footers, and internal data structures.
brew 'freetype' # a freely available software library to render fonts.
brew 'gcc' # The GNU Compiler Collection includes front ends for C, C++, Objective-C, Fortran, Ada, and Go, as well as libraries for these languages (libstdc++,...)
brew 'git' # a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.
brew 'git-flow-avh' # AVH Edition of the git extensions to provide high-level repository operations for Vincent Driessen's branching model
brew 'git-lfs' # Git extension for versioning large files
brew 'gmp' # is a free library for arbitrary precision arithmetic, operating on signed integers, rational numbers, and floating-point numbers.
brew 'gnu-getopt' # parse command-line arguments from shell scripts
brew 'gnu-sed' # sed (stream editor) is a non-interactive command-line text editor.
brew 'grep' # searches one or more input files for lines containing a match to a specified pattern.
brew 'hashpump' # A tool to exploit the hash length extension attack in various hashing algorithms
brew 'heroku' # a tool for creating and managing Heroku apps from the command line / shell of various operating systems.
brew 'hub' # a command-line wrapper for git that makes you better at GitHub.
brew 'imagemagick'
brew 'john' # John the Ripper password cracker
brew 'jpeg' # Image manipulation library
brew 'knock' # Port-knock server
brew 'lame' # High quality MPEG Audio Layer III (MP3) encoder
brew 'libdnet' # Portable low-level networking library
brew 'libevent' # Asynchronous event library
brew 'libidn' # International domain name library
brew 'libmpc' # C library for the arithmetic of high precision complex numbers
brew 'libpng' # Library for manipulating PNG images
brew 'libtiff' # TIFF library and utilities
brew 'libtool' # Generic library support script
brew 'libxml2' # GNOME XML library
brew 'lua' # Powerful, lightweight programming language
brew 'lynx' # Text-based web browser
brew 'mackup' # Keep your Mac's application settings in sync
brew 'mas' # Mac App Store command line interface
brew 'moreutils' # Collection of tools that nobody wrote when UNIX was young
brew 'mpfr' # C library for multiple-precision floating-point computations
brew 'mysql' # Open source relational database management system
brew 'netpbm' # Image manipulation
brew 'ngrep' # Network grep
brew 'nmap' # Port scanning utility for large networks
brew 'node' # JS Platform built on V8 to build network applications
brew 'nodenv' # Manage multiple NodeJS versions.
brew 'openssh' # the premier connectivity tool for remote login with the SSH protocol.
brew 'openssl' # SSL/TLS cryptography library
brew 'overmind'
brew 'p7zip' # 7-Zip (high compression file archiver) implementation
brew 'pcre' # Perl compatible regular expressions library
brew 'pigz' # Parallel gzip
brew 'pkg-config' # Manage compile and link flags for libraries
brew 'pngcheck' # Print info and check PNG, JNG, and MNG files
brew 'postgresql' # Object-relational database system
brew 'pv' # Monitor data's progress through a pipe
brew 'pyenv' # Simple Python version management
brew 'rbenv' # Ruby version manager
brew 'readline' # Library for command-line editing
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'rename' # Perl-powered file rename script with many helpful built-ins
brew 'ruby-build' # Install various Ruby versions and implementations
brew 'screen' # a full-screen window manager that multiplexes a physical terminal between several processes, typically interactive shells.
brew 'socat' # netcat on steroids
brew 'speedtest_cli' # Command-line interface for https://speedtest.net bandwidth tests
brew 'sqlite' # Command-line interface for SQLite
brew 'sqlmap' # Penetration testing for SQL injection and database servers
brew 'ssdeep' # Recursive piecewise hashing tool
brew 'ssh-copy-id' # Add a public key to a remote machine's authorized_keys file
brew 'tcpflow' # TCP flow recorder
brew 'tcpreplay' # Replay saved tcpdump files at arbitrary speeds
brew 'tcptrace' # Analyze tcpdump output
brew 'terminal-notifier'
brew 'testssl' # Tool which checks for the support of TLS/SSL ciphers and flaws
brew 'tor' # Anonymizing overlay network for TCP
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'ucspi-tcp' # Tools for building TCP client-server applications
brew 'vbindiff' # Visual Binary Diff
brew 'vim' # Vi 'workalike' with many additional features
brew 'webkit2png' # Create screenshots of webpages from the terminal
brew 'webp' # Image format providing lossless and lossy compression for web images
brew 'wget' # for retrieving files using HTTP, HTTPS, FTP and FTPS the most widely-used Internet protocols.
brew 'x264' # H.264/AVC encoder
brew 'xvid' # High-performance, high-quality MPEG-4 video library
brew 'xz' # General-purpose data compression with high compression ratio
brew 'youtube-dl' # Download YouTube videos from the command-line
brew 'zopfli' # New zlib (gzip, deflate) compatible compressor

cask '1password'
cask 'acorn'
cask 'adoptopenjdk8'
cask 'airserver'
cask 'alfred'
cask 'android-messages'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'anki'
cask 'bartender'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'ccmenu'
cask 'chromedriver'
cask 'colloquy'
cask 'controlplane'
cask 'deluge'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'font-fira-sans'
cask 'font-source-code-pro-for-powerline'
cask 'forklift'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'google-hangouts'
cask 'google-photos-backup-and-sync'
cask 'gpg-suite'
cask 'handbrake'
cask 'hazel'
cask 'horndis' # driver for Mac OS X that allows you to use your Android phone's native USB tethering mode to get Internet access.
cask 'imageoptim'
cask 'inkscape'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'jdiskreport'
cask 'kaleidoscope'
cask 'launchrocket'
cask 'libreoffice'
cask 'little-snitch'
cask 'macvim'
cask 'micro-snitch'
cask 'moom'
cask 'namechanger'
cask 'ngrok'
cask 'nzbvortex'
cask 'opera'
cask 'plex-media-player'
cask 'postico'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookapk'
cask 'quicklookase'
cask 'resxtreme'
cask 'shimo'
cask 'simple-comic'
cask 'simplenote'
cask 'slack'
cask 'snagit'
cask 'sourcetree'
cask 'spark'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'tinymediamanager'
cask 'tower'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'webpquicklook'
cask 'whatsapp'
cask 'xquartz'
cask 'xscreensaver'

mas 'Magnet', id: 441258766
mas 'Sleepytime', id: 404302586
mas 'Spark', id: 1176895641
