tap 'bramstein/webfonttools'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/versions'
cask 'java'
brew 'ack'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'aircrack-ng'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bfg'
brew 'binutils'
brew 'gmp'
brew 'isl'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'p7zip'
brew 'ssdeep'
brew 'xz'
brew 'binwalk'
brew 'cifer'
brew 'coreutils'
brew 'dark-mode'
brew 'dex2jar'
brew 'dns2tcp'
brew 'elasticsearch'
brew 'fcrackzip'
brew 'lame'
brew 'git'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'findutils'
brew 'foremost'
brew 'libpng'
brew 'freetype'
brew 'gettext'
brew 'gnu-getopt'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gnu-sed', args: ['with-default-names']
brew 'hashpump'
brew 'heroku'
brew 'hub'
brew 'mysql'
brew 'hydra'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'imagemagick', args: ['with-webp']
brew 'jasper'
brew 'john'
brew 'knock'
brew 'libdnet'
brew 'libevent'
brew 'libidn'
brew 'libxml2'
brew 'lua'
brew 'lynx'
brew 'mackup'
brew 'moreutils'
brew 'netpbm'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'pcre'
brew 'pigz'
brew 'pkg-config'
brew 'pngcheck'
brew 'postgresql'
brew 'pv'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'rename'
brew 'socat'
brew 'speedtest_cli'
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'testssl'
brew 'tor'
brew 'tree'
brew 'ucspi-tcp'
brew 'vbindiff'
brew 'vim', args: ['with-override-system-vi']
brew 'webkit2png'
brew 'webp'
brew 'wget', args: ['with-iri']
brew 'youtube-dl'
brew 'zopfli'
brew 'bramstein/webfonttools/sfnt2woff'
brew 'bramstein/webfonttools/sfnt2woff-zopfli'
brew 'bramstein/webfonttools/woff2'
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/versions/bash-completion2'
cask '1password'
cask 'airserver'
cask 'alfred'
cask 'anki'
cask 'bartender'
cask 'caffeine'
cask 'cocktail'
cask 'colloquy'
cask 'controlplane'
cask 'crashplan'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'font-fira-sans'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'horndis'
cask 'istat-menus'
cask 'iterm2'
cask 'jdiskreport'
cask 'kodi'
cask 'launchrocket'
cask 'libreoffice'
cask 'little-snitch'
cask 'macvim'
cask 'moom'
cask 'namechanger'
cask 'ngrok'
cask 'nzbvortex'
cask 'opera'
cask 'screenhero'
cask 'simple-comic'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'tower'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'xscreensaver'
