
brew 'ack' # a tool like grep, optimized for programmers
brew 'asdf' # multi-language version manager (ruby, node, python, etc.)
brew 'aircrack-ng' # a complete suite of tools to assess WiFi network security.
brew 'ansible' # Radically simple IT automation
brew 'autoconf' # an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages.
brew 'automake' # a tool for automatically generating Makefile in files compliant with the GNU Coding Standards
brew 'awscli' # a unified tool to manage your AWS services.
brew 'bash' # an sh-compatible shell that incorporates useful features from the Korn shell (ksh) and C shell (csh)
brew 'bash-completion@2' # Programmable completion functions for bash
brew 'bat' # Better cat with syntax highlighting and git integration
brew 'bats-core' # Bash Automated Testing System (used by dotfiles tests)
brew 'bfg' # Removes large or troublesome blobs like git-filter-branch does, but faster. And written in Scala
brew 'binutils' # The GNU Binutils are a collection of binary tools
brew 'cifer' # Work on automating classical cipher cracking in C.
brew 'coreutils' # The GNU Core Utilities are the basic file, shell and text manipulation utilities of the GNU operating system.
brew 'curl'
brew 'delta' # Better git diffs with syntax highlighting
brew 'direnv' # Per-directory environment variable loading
brew 'docker' # Docker CLI
brew 'dns2tcp' # Dns2tcp is a network tool designed to relay TCP connections through DNS traffic.
brew 'fcrackzip' # FCrackZip is a free and fast zip password cracker
brew 'fd' # Fast and user-friendly alternative to find
brew 'ffmpeg' # a complete, cross-platform solution to record, convert and stream audio and video. It includes libavcodec - the leading audio/video codec library.
brew 'findutils' # The GNU Find Utilities are the basic directory searching utilities of the GNU operating system.
brew 'foremost' # a console program to recover files based on their headers, footers, and internal data structures.
brew 'freetype' # a freely available software library to render fonts.
brew 'fzf' # Command-line fuzzy finder
brew 'gcc' # The GNU Compiler Collection includes front ends for C, C++, Objective-C, Fortran, Ada, and Go, as well as libraries for these languages (libstdc++,...)
brew 'gh' # GitHub CLI — the official GitHub command-line tool.
brew 'git' # a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.
brew 'git-flow' # Git extensions for Vincent Driessen's branching model
brew 'git-lfs' # Git extension for versioning large files
brew 'gmp' # is a free library for arbitrary precision arithmetic, operating on signed integers, rational numbers, and floating-point numbers.
brew 'gnu-getopt' # parse command-line arguments from shell scripts
brew 'gnu-sed' # sed (stream editor) is a non-interactive command-line text editor.
brew 'grep' # searches one or more input files for lines containing a match to a specified pattern.
brew 'heroku' # a tool for creating and managing Heroku apps from the command line / shell of various operating systems.
brew 'imagemagick'
brew 'john' # John the Ripper password cracker
brew 'jpeg' # Image manipulation library
brew 'jq' # Lightweight JSON processor
brew 'k9s' # Kubernetes TUI cluster manager
brew 'knock' # Port-knock server
brew 'lame' # High quality MPEG Audio Layer III (MP3) encoder
brew 'lazygit' # Terminal UI for git
brew 'libdnet' # Portable low-level networking library
brew 'libevent' # Asynchronous event library
brew 'libidn' # International domain name library
brew 'libmpc' # C library for the arithmetic of high precision complex numbers
brew 'libpng' # Library for manipulating PNG images
brew 'libtiff' # TIFF library and utilities
brew 'libtool' # Generic library support script
brew 'libxml2' # GNOME XML library
brew 'llm' # CLI for interacting with LLMs (run: llm install llm-anthropic && llm keys set anthropic)
brew 'lsusb' # List USB devices
brew 'lua' # Powerful, lightweight programming language
brew 'lynx' # Text-based web browser
brew 'mackup' # Keep your Mac's application settings in sync
brew 'mas' # Mac App Store command line interface
brew 'mkcert' # Simple local HTTPS development certificates
brew 'moreutils' # Collection of tools that nobody wrote when UNIX was young
brew 'mpfr' # C library for multiple-precision floating-point computations
brew 'mysql' # Open source relational database management system
brew 'netpbm' # Image manipulation
brew 'ngrep' # Network grep
brew 'nmap' # Port scanning utility for large networks
brew 'node' # JS Platform built on V8 to build network applications
# After node is installed: npm install -g @anthropic-ai/claude-code
brew 'nodenv' # Manage multiple NodeJS versions.
brew 'openssh' # the premier connectivity tool for remote login with the SSH protocol.
brew 'openssl' # SSL/TLS cryptography library
brew 'overmind'
brew 'p7zip' # 7-Zip (high compression file archiver) implementation
brew 'pcre' # Perl compatible regular expressions library
brew 'pigz' # Parallel gzip
brew 'pinentry-mac' # macOS-native passphrase dialog for GPG agent
brew 'pkg-config' # Manage compile and link flags for libraries
brew 'pngcheck' # Print info and check PNG, JNG, and MNG files
brew 'poppler' # PDF rendering library (includes pdftotext, pdfimages, etc.)
brew 'postgresql' # Object-relational database system
brew 'pv' # Monitor data's progress through a pipe
brew 'pyenv' # Simple Python version management
brew 'qemu' # Generic machine emulator and virtualizer
brew 'rbenv' # Ruby version manager
brew 'readline' # Library for command-line editing
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'rename' # Perl-powered file rename script with many helpful built-ins
brew 'ruby-build' # Install various Ruby versions and implementations
brew 'scrcpy' # Display and control Android devices over USB or TCP/IP
brew 'screen' # a full-screen window manager that multiplexes a physical terminal between several processes, typically interactive shells.
brew 'socat' # netcat on steroids
brew 'speedtest_cli' # Command-line interface for https://speedtest.net bandwidth tests
brew 'sqlite' # Command-line interface for SQLite
brew 'sqlmap' # Penetration testing for SQL injection and database servers
brew 'ssdeep' # Recursive piecewise hashing tool
brew 'ssh-copy-id' # Add a public key to a remote machine's authorized_keys file
brew 'tailscale' # Mesh VPN based on WireGuard
brew 'tcpflow' # TCP flow recorder
brew 'tcpreplay' # Replay saved tcpdump files at arbitrary speeds
brew 'terminal-notifier'
brew 'testssl' # Tool which checks for the support of TLS/SSL ciphers and flaws
brew 'tor' # Anonymizing overlay network for TCP
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'ucspi-tcp' # Tools for building TCP client-server applications
brew 'vbindiff' # Visual Binary Diff
brew 'vim' # Vi 'workalike' with many additional features
brew 'webkit2png' # Create screenshots of webpages from the terminal
brew 'webp' # Image format providing lossless and lossy compression for web images
brew 'wget' # for retrieving files using HTTP, HTTPS, FTP and FTPS the most widely-used Internet protocols.
brew 'x264' # H.264/AVC encoder
brew 'xvid' # High-performance, high-quality MPEG-4 video library
brew 'xz' # General-purpose data compression with high compression ratio
brew 'yt-dlp' # Download YouTube videos from the command-line (actively maintained youtube-dl fork)
brew 'zopfli' # New zlib (gzip, deflate) compatible compressor
brew 'zoxide' # Smarter cd with frecency-based directory jumping
brew 'zsh-autosuggestions' # Fish-style autosuggestions from shell history
brew 'zsh-completions' # Additional completions for zsh
brew 'zsh-syntax-highlighting' # Fish-style syntax highlighting for zsh

# AI / LLM tools
brew 'ollama' # Run large language models locally (llama3, mistral, etc.)

cask '1password'
cask '1password-cli' # 1Password CLI for scripting and vault access
cask 'acorn'
cask 'temurin' # Eclipse Temurin OpenJDK (replaces adoptopenjdk)
cask 'airserver'
cask 'alfred'
cask 'android-commandlinetools' # Android SDK command-line tools
cask 'android-platform-tools'
cask 'anki'
cask 'balenaetcher' # Flash OS images to SD cards and USB drives
cask 'bartender'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'ccmenu'
cask 'chromedriver'
cask 'claude' # Anthropic Claude desktop app
cask 'claude-code' # Anthropic Claude Code CLI
cask 'codex' # OpenAI Codex desktop app
cask 'comfyui' # Node-based UI for Stable Diffusion / local AI image generation
cask 'daisydisk'
cask 'deluge'
cask 'displaylink' # DisplayLink USB graphics driver
cask 'docker-desktop' # Docker Desktop
cask 'dropbox'
cask 'fantastical'
cask 'ferdium' # All-in-one messaging app (Slack, Discord, WhatsApp, etc.)
cask 'fission' # Fast, lossless audio editor
cask 'firefox'
cask 'font-fira-sans'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'forklift'
cask 'gcloud-cli' # Google Cloud SDK and CLI tools
cask 'github' # GitHub Desktop
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'handbrake'
cask 'hazel'
cask 'imageoptim'
cask 'inkscape'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'libreoffice'
cask 'little-snitch'
cask 'lm-studio' # GUI for running local LLMs
cask 'macvim'
cask 'micro-snitch'
cask 'microsoft-teams' # Microsoft Teams
cask 'moom'
cask 'namechanger'
cask 'neardrop' # AirDrop-like sharing with nearby Android and Windows devices
cask 'ngrok'
cask 'nzbvortex'
cask 'openaudible' # Audible audiobook manager and converter
cask 'opera'
cask 'plex' # Plex media player
cask 'postico'
cask 'avifquicklook'
cask 'ipynb-quicklook'
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlzipinfo'
cask 'quickjson'
cask 'quicklook-csv'
cask 'quicklook-video'
cask 'quicklookase'
cask 'shimo'
cask 'simple-comic'
cask 'simplenote'
cask 'slack'
cask 'snagit'
cask 'sourcetree'
cask 'spark'
cask 'spotify'
cask 'steam'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'tinymediamanager'
cask 'tower'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'whatsapp'
cask 'xquartz'
cask 'xscreensaver'

mas 'DaVinci Resolve', id: 571213070
mas 'Ethernet Status', id: 1186187538
mas 'Folder Preview', id: 6698876601
mas 'MacDroid', id: 1476545828
mas 'Magnet', id: 441258766
mas 'Mp3tag', id: 1532597159
mas 'Sleepytime', id: 404302586
mas 'Spark', id: 1176895641
